FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_ac.h
/**
 * \file
 *
 * \brief Component description for AC
 *
 * Copyright (c) 2013 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMD20_AC_COMPONENT_
#define _SAMD20_AC_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR AC */
/* ========================================================================== */
/** \addtogroup SAMD20_AC Analog Comparators */
/*@{*/

#define REV_AC    0x110

/* -------- AC_CTRLA : (AC Offset: 0x00) (R/W  8) Control A Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t SWRST : 1;    /*!< bit:      0  Software Reset                     */
            uint8_t ENABLE : 1;   /*!< bit:      1  Enable                             */
            uint8_t RUNSTDBY : 1; /*!< bit:      2  Run during Standby                 */
            uint8_t  : 5;         /*!< bit:  3.. 7  Reserved                           */
        } bit;                    /*!< Structure used for bit  access                  */
        uint8_t reg;              /*!< Type      used for register access              */
    } AC_CTRLA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AC_CTRLA_OFFSET          0x00            /**< \brief (AC_CTRLA offset) Control A Register */
#define AC_CTRLA_RESETVALUE      0x00            /**< \brief (AC_CTRLA reset_value) Control A Register */

#define AC_CTRLA_SWRST_Pos       0               /**< \brief (AC_CTRLA) Software Reset */
#define AC_CTRLA_SWRST           ( 0x1u << AC_CTRLA_SWRST_Pos )
#define AC_CTRLA_ENABLE_Pos      1               /**< \brief (AC_CTRLA) Enable */
#define AC_CTRLA_ENABLE          ( 0x1u << AC_CTRLA_ENABLE_Pos )
#define AC_CTRLA_RUNSTDBY_Pos    2               /**< \brief (AC_CTRLA) Run during Standby */
#define AC_CTRLA_RUNSTDBY_Msk    ( 0x1u << AC_CTRLA_RUNSTDBY_Pos )
#define AC_CTRLA_RUNSTDBY( value )    ( ( AC_CTRLA_RUNSTDBY_Msk & ( ( value ) << AC_CTRLA_RUNSTDBY_Pos ) ) )
#define AC_CTRLA_MASK            0x07u           /**< \brief (AC_CTRLA) MASK Register */

/* -------- AC_CTRLB : (AC Offset: 0x01) ( /W  8) Control B Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t START0 : 1; /*!< bit:      0  Comparator 0 Start Comparison      */
            uint8_t START1 : 1; /*!< bit:      1  Comparator 1 Start Comparison      */
            uint8_t START2 : 1; /*!< bit:      2  Comparator 2 Start Comparison      */
            uint8_t START3 : 1; /*!< bit:      3  Comparator 3 Start Comparison      */
            uint8_t  : 4;       /*!< bit:  4.. 7  Reserved                           */
        } bit;                  /*!< Structure used for bit  access                  */
        uint8_t reg;            /*!< Type      used for register access              */
    } AC_CTRLB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AC_CTRLB_OFFSET        0x01              /**< \brief (AC_CTRLB offset) Control B Register */
#define AC_CTRLB_RESETVALUE    0x00              /**< \brief (AC_CTRLB reset_value) Control B Register */

#define AC_CTRLB_START0_Pos    0                 /**< \brief (AC_CTRLB) Comparator 0 Start Comparison */
#define AC_CTRLB_START0        ( 0x1u << AC_CTRLB_START0_Pos )
#define AC_CTRLB_START1_Pos    1                 /**< \brief (AC_CTRLB) Comparator 1 Start Comparison */
#define AC_CTRLB_START1        ( 0x1u << AC_CTRLB_START1_Pos )
#define AC_CTRLB_START2_Pos    2                 /**< \brief (AC_CTRLB) Comparator 2 Start Comparison */
#define AC_CTRLB_START2        ( 0x1u << AC_CTRLB_START2_Pos )
#define AC_CTRLB_START3_Pos    3                 /**< \brief (AC_CTRLB) Comparator 3 Start Comparison */
#define AC_CTRLB_START3        ( 0x1u << AC_CTRLB_START3_Pos )
#define AC_CTRLB_MASK          0x0Fu             /**< \brief (AC_CTRLB) MASK Register */

/* -------- AC_EVCTRL : (AC Offset: 0x02) (R/W 16) Event Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t COMPEO0 : 1; /*!< bit:      0  Comparator 0 Event Output Enable   */
            uint16_t COMPEO1 : 1; /*!< bit:      1  Comparator 1 Event Output Enable   */
            uint16_t COMPEO2 : 1; /*!< bit:      2  Comparator 2 Event Output Enable   */
            uint16_t COMPEO3 : 1; /*!< bit:      3  Comparator 3 Event Output Enable   */
            uint16_t WINEO0 : 1;  /*!< bit:      4  Window 0 Event Output Enable       */
            uint16_t WINEO1 : 1;  /*!< bit:      5  Window 1 Event Output Enable       */
            uint16_t : 2;         /*!< bit:  6.. 7  Reserved                           */
            uint16_t COMPEI0 : 1; /*!< bit:      8  Comparator 0 Event Input Enable    */
            uint16_t COMPEI1 : 1; /*!< bit:      9  Comparator 1 Event Input Enable    */
            uint16_t COMPEI2 : 1; /*!< bit:     10  Comparator 2 Event Input Enable    */
            uint16_t COMPEI3 : 1; /*!< bit:     11  Comparator 3 Event Input Enable    */
            uint16_t : 4;         /*!< bit: 12..15  Reserved                           */
        } bit;                    /*!< Structure used for bit  access                  */
        uint16_t reg;             /*!< Type      used for register access              */
    } AC_EVCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AC_EVCTRL_OFFSET         0x02            /**< \brief (AC_EVCTRL offset) Event Control Register */
#define AC_EVCTRL_RESETVALUE     0x0000          /**< \brief (AC_EVCTRL reset_value) Event Control Register */

#define AC_EVCTRL_COMPEO0_Pos    0               /**< \brief (AC_EVCTRL) Comparator 0 Event Output Enable */
#define AC_EVCTRL_COMPEO0        ( 0x1u << AC_EVCTRL_COMPEO0_Pos )
#define AC_EVCTRL_COMPEO1_Pos    1               /**< \brief (AC_EVCTRL) Comparator 1 Event Output Enable */
#define AC_EVCTRL_COMPEO1        ( 0x1u << AC_EVCTRL_COMPEO1_Pos )
#define AC_EVCTRL_COMPEO2_Pos    2               /**< \brief (AC_EVCTRL) Comparator 2 Event Output Enable */
#define AC_EVCTRL_COMPEO2        ( 0x1u << AC_EVCTRL_COMPEO2_Pos )
#define AC_EVCTRL_COMPEO3_Pos    3               /**< \brief (AC_EVCTRL) Comparator 3 Event Output Enable */
#define AC_EVCTRL_COMPEO3        ( 0x1u << AC_EVCTRL_COMPEO3_Pos )
#define AC_EVCTRL_WINEO0_Pos     4               /**< \brief (AC_EVCTRL) Window 0 Event Output Enable */
#define AC_EVCTRL_WINEO0         ( 0x1u << AC_EVCTRL_WINEO0_Pos )
#define AC_EVCTRL_WINEO1_Pos     5               /**< \brief (AC_EVCTRL) Window 1 Event Output Enable */
#define AC_EVCTRL_WINEO1         ( 0x1u << AC_EVCTRL_WINEO1_Pos )
#define AC_EVCTRL_COMPEI0_Pos    8               /**< \brief (AC_EVCTRL) Comparator 0 Event Input Enable */
#define AC_EVCTRL_COMPEI0        ( 0x1u << AC_EVCTRL_COMPEI0_Pos )
#define AC_EVCTRL_COMPEI1_Pos    9               /**< \brief (AC_EVCTRL) Comparator 1 Event Input Enable */
#define AC_EVCTRL_COMPEI1        ( 0x1u << AC_EVCTRL_COMPEI1_Pos )
#define AC_EVCTRL_COMPEI2_Pos    10              /**< \brief (AC_EVCTRL) Comparator 2 Event Input Enable */
#define AC_EVCTRL_COMPEI2        ( 0x1u << AC_EVCTRL_COMPEI2_Pos )
#define AC_EVCTRL_COMPEI3_Pos    11              /**< \brief (AC_EVCTRL) Comparator 3 Event Input Enable */
#define AC_EVCTRL_COMPEI3        ( 0x1u << AC_EVCTRL_COMPEI3_Pos )
#define AC_EVCTRL_MASK           0x0F3Fu         /**< \brief (AC_EVCTRL) MASK Register */

