FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_ac.h
/* -------- AC_INTENCLR : (AC Offset: 0x04) (R/W  8) Interrupt Enable Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t COMP0 : 1; /*!< bit:      0  Comparator 0 Interrupt Disable     */
            uint8_t COMP1 : 1; /*!< bit:      1  Comparator 1 Interrupt Disable     */
            uint8_t COMP2 : 1; /*!< bit:      2  Comparator 2 Interrupt Disable     */
            uint8_t COMP3 : 1; /*!< bit:      3  Comparator 3 Interrupt Disable     */
            uint8_t WIN0 : 1;  /*!< bit:      4  Window 0 Interrupt Disable         */
            uint8_t WIN1 : 1;  /*!< bit:      5  Window 1 Interrupt Disable         */
            uint8_t  : 2;      /*!< bit:  6.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } AC_INTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AC_INTENCLR_OFFSET        0x04           /**< \brief (AC_INTENCLR offset) Interrupt Enable Clear Register */
#define AC_INTENCLR_RESETVALUE    0x00           /**< \brief (AC_INTENCLR reset_value) Interrupt Enable Clear Register */

#define AC_INTENCLR_COMP0_Pos     0              /**< \brief (AC_INTENCLR) Comparator 0 Interrupt Disable */
#define AC_INTENCLR_COMP0         ( 0x1u << AC_INTENCLR_COMP0_Pos )
#define AC_INTENCLR_COMP1_Pos     1              /**< \brief (AC_INTENCLR) Comparator 1 Interrupt Disable */
#define AC_INTENCLR_COMP1         ( 0x1u << AC_INTENCLR_COMP1_Pos )
#define AC_INTENCLR_COMP2_Pos     2              /**< \brief (AC_INTENCLR) Comparator 2 Interrupt Disable */
#define AC_INTENCLR_COMP2         ( 0x1u << AC_INTENCLR_COMP2_Pos )
#define AC_INTENCLR_COMP3_Pos     3              /**< \brief (AC_INTENCLR) Comparator 3 Interrupt Disable */
#define AC_INTENCLR_COMP3         ( 0x1u << AC_INTENCLR_COMP3_Pos )
#define AC_INTENCLR_WIN0_Pos      4              /**< \brief (AC_INTENCLR) Window 0 Interrupt Disable */
#define AC_INTENCLR_WIN0          ( 0x1u << AC_INTENCLR_WIN0_Pos )
#define AC_INTENCLR_WIN1_Pos      5              /**< \brief (AC_INTENCLR) Window 1 Interrupt Disable */
#define AC_INTENCLR_WIN1          ( 0x1u << AC_INTENCLR_WIN1_Pos )
#define AC_INTENCLR_MASK          0x3Fu          /**< \brief (AC_INTENCLR) MASK Register */

/* -------- AC_INTENSET : (AC Offset: 0x05) (R/W  8) Interrupt Enable Set Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t COMP0 : 1; /*!< bit:      0  Comparator 0 Interrupt Enable      */
            uint8_t COMP1 : 1; /*!< bit:      1  Comparator 1 Interrupt Enable      */
            uint8_t COMP2 : 1; /*!< bit:      2  Comparator 2 Interrupt Enable      */
            uint8_t COMP3 : 1; /*!< bit:      3  Comparator 3 Interrupt Enable      */
            uint8_t WIN0 : 1;  /*!< bit:      4  Window 0 Interrupt Enable          */
            uint8_t WIN1 : 1;  /*!< bit:      5  Window 1 Interrupt Enable          */
            uint8_t  : 2;      /*!< bit:  6.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } AC_INTENSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AC_INTENSET_OFFSET        0x05           /**< \brief (AC_INTENSET offset) Interrupt Enable Set Register */
#define AC_INTENSET_RESETVALUE    0x00           /**< \brief (AC_INTENSET reset_value) Interrupt Enable Set Register */

#define AC_INTENSET_COMP0_Pos     0              /**< \brief (AC_INTENSET) Comparator 0 Interrupt Enable */
#define AC_INTENSET_COMP0         ( 0x1u << AC_INTENSET_COMP0_Pos )
#define AC_INTENSET_COMP1_Pos     1              /**< \brief (AC_INTENSET) Comparator 1 Interrupt Enable */
#define AC_INTENSET_COMP1         ( 0x1u << AC_INTENSET_COMP1_Pos )
#define AC_INTENSET_COMP2_Pos     2              /**< \brief (AC_INTENSET) Comparator 2 Interrupt Enable */
#define AC_INTENSET_COMP2         ( 0x1u << AC_INTENSET_COMP2_Pos )
#define AC_INTENSET_COMP3_Pos     3              /**< \brief (AC_INTENSET) Comparator 3 Interrupt Enable */
#define AC_INTENSET_COMP3         ( 0x1u << AC_INTENSET_COMP3_Pos )
#define AC_INTENSET_WIN0_Pos      4              /**< \brief (AC_INTENSET) Window 0 Interrupt Enable */
#define AC_INTENSET_WIN0          ( 0x1u << AC_INTENSET_WIN0_Pos )
#define AC_INTENSET_WIN1_Pos      5              /**< \brief (AC_INTENSET) Window 1 Interrupt Enable */
#define AC_INTENSET_WIN1          ( 0x1u << AC_INTENSET_WIN1_Pos )
#define AC_INTENSET_MASK          0x3Fu          /**< \brief (AC_INTENSET) MASK Register */

/* -------- AC_INTFLAG : (AC Offset: 0x06) (R/W  8) Interrupt Flag Status and Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t COMP0 : 1; /*!< bit:      0  Comparator 0 Interrupt Flag        */
            uint8_t COMP1 : 1; /*!< bit:      1  Comparator 1 Interrupt Flag        */
            uint8_t COMP2 : 1; /*!< bit:      2  Comparator 2 Interrupt Flag        */
            uint8_t COMP3 : 1; /*!< bit:      3  Comparator 3 Interrupt Flag        */
            uint8_t WIN0 : 1;  /*!< bit:      4  Window 0 Interrupt Flag            */
            uint8_t WIN1 : 1;  /*!< bit:      5  Window 1 Interrupt Flag            */
            uint8_t  : 2;      /*!< bit:  6.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } AC_INTFLAG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AC_INTFLAG_OFFSET        0x06            /**< \brief (AC_INTFLAG offset) Interrupt Flag Status and Clear Register */
#define AC_INTFLAG_RESETVALUE    0x00            /**< \brief (AC_INTFLAG reset_value) Interrupt Flag Status and Clear Register */

#define AC_INTFLAG_COMP0_Pos     0               /**< \brief (AC_INTFLAG) Comparator 0 Interrupt Flag */
#define AC_INTFLAG_COMP0         ( 0x1u << AC_INTFLAG_COMP0_Pos )
#define AC_INTFLAG_COMP1_Pos     1               /**< \brief (AC_INTFLAG) Comparator 1 Interrupt Flag */
#define AC_INTFLAG_COMP1         ( 0x1u << AC_INTFLAG_COMP1_Pos )
#define AC_INTFLAG_COMP2_Pos     2               /**< \brief (AC_INTFLAG) Comparator 2 Interrupt Flag */
#define AC_INTFLAG_COMP2         ( 0x1u << AC_INTFLAG_COMP2_Pos )
#define AC_INTFLAG_COMP3_Pos     3               /**< \brief (AC_INTFLAG) Comparator 3 Interrupt Flag */
#define AC_INTFLAG_COMP3         ( 0x1u << AC_INTFLAG_COMP3_Pos )
#define AC_INTFLAG_WIN0_Pos      4               /**< \brief (AC_INTFLAG) Window 0 Interrupt Flag */
#define AC_INTFLAG_WIN0          ( 0x1u << AC_INTFLAG_WIN0_Pos )
#define AC_INTFLAG_WIN1_Pos      5               /**< \brief (AC_INTFLAG) Window 1 Interrupt Flag */
#define AC_INTFLAG_WIN1          ( 0x1u << AC_INTFLAG_WIN1_Pos )
#define AC_INTFLAG_MASK          0x3Fu           /**< \brief (AC_INTFLAG) MASK Register */

