FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_ac.h
/* -------- AC_STATUSA : (AC Offset: 0x08) (R/   8) Status A Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t STATE0 : 1;  /*!< bit:      0  Comparator 0 Current State         */
            uint8_t STATE1 : 1;  /*!< bit:      1  Comparator 1 Current State         */
            uint8_t STATE2 : 1;  /*!< bit:      2  Comparator 2 Current State         */
            uint8_t STATE3 : 1;  /*!< bit:      3  Comparator 3 Current State         */
            uint8_t WSTATE0 : 2; /*!< bit:  4.. 5  Window 0 Current State             */
            uint8_t WSTATE1 : 2; /*!< bit:  6.. 7  Window 1 Current State             */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } AC_STATUSA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AC_STATUSA_OFFSET              0x08      /**< \brief (AC_STATUSA offset) Status A Register */
#define AC_STATUSA_RESETVALUE          0x00      /**< \brief (AC_STATUSA reset_value) Status A Register */

#define AC_STATUSA_STATE0_Pos          0         /**< \brief (AC_STATUSA) Comparator 0 Current State */
#define AC_STATUSA_STATE0              ( 0x1u << AC_STATUSA_STATE0_Pos )
#define AC_STATUSA_STATE1_Pos          1         /**< \brief (AC_STATUSA) Comparator 1 Current State */
#define AC_STATUSA_STATE1              ( 0x1u << AC_STATUSA_STATE1_Pos )
#define AC_STATUSA_STATE2_Pos          2         /**< \brief (AC_STATUSA) Comparator 2 Current State */
#define AC_STATUSA_STATE2              ( 0x1u << AC_STATUSA_STATE2_Pos )
#define AC_STATUSA_STATE3_Pos          3         /**< \brief (AC_STATUSA) Comparator 3 Current State */
#define AC_STATUSA_STATE3              ( 0x1u << AC_STATUSA_STATE3_Pos )
#define AC_STATUSA_WSTATE0_Pos         4         /**< \brief (AC_STATUSA) Window 0 Current State */
#define AC_STATUSA_WSTATE0_Msk         ( 0x3u << AC_STATUSA_WSTATE0_Pos )
#define AC_STATUSA_WSTATE0( value )    ( ( AC_STATUSA_WSTATE0_Msk & ( ( value ) << AC_STATUSA_WSTATE0_Pos ) ) )
#define   AC_STATUSA_WSTATE0_ABOVE     ( 0x0u << 4 ) /**< \brief (AC_STATUSA)  */
#define   AC_STATUSA_WSTATE0_INSIDE    ( 0x1u << 4 ) /**< \brief (AC_STATUSA)  */
#define   AC_STATUSA_WSTATE0_BELOW     ( 0x2u << 4 ) /**< \brief (AC_STATUSA)  */
#define AC_STATUSA_WSTATE1_Pos         6             /**< \brief (AC_STATUSA) Window 1 Current State */
#define AC_STATUSA_WSTATE1_Msk         ( 0x3u << AC_STATUSA_WSTATE1_Pos )
#define AC_STATUSA_WSTATE1( value )    ( ( AC_STATUSA_WSTATE1_Msk & ( ( value ) << AC_STATUSA_WSTATE1_Pos ) ) )
#define   AC_STATUSA_WSTATE1_ABOVE     ( 0x0u << 6 ) /**< \brief (AC_STATUSA)  */
#define   AC_STATUSA_WSTATE1_INSIDE    ( 0x1u << 6 ) /**< \brief (AC_STATUSA)  */
#define   AC_STATUSA_WSTATE1_BELOW     ( 0x2u << 6 ) /**< \brief (AC_STATUSA)  */
#define AC_STATUSA_MASK                0xFFu         /**< \brief (AC_STATUSA) MASK Register */

/* -------- AC_STATUSB : (AC Offset: 0x09) (R/   8) Status B Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t READY0 : 1;   /*!< bit:      0  Comparator 0 Ready                 */
            uint8_t READY1 : 1;   /*!< bit:      1  Comparator 1 Ready                 */
            uint8_t READY2 : 1;   /*!< bit:      2  Comparator 2 Ready                 */
            uint8_t READY3 : 1;   /*!< bit:      3  Comparator 3 Ready                 */
            uint8_t  : 3;         /*!< bit:  4.. 6  Reserved                           */
            uint8_t SYNCBUSY : 1; /*!< bit:      7  Synchronization Busy               */
        } bit;                    /*!< Structure used for bit  access                  */
        uint8_t reg;              /*!< Type      used for register access              */
    } AC_STATUSB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AC_STATUSB_OFFSET          0x09          /**< \brief (AC_STATUSB offset) Status B Register */
#define AC_STATUSB_RESETVALUE      0x00          /**< \brief (AC_STATUSB reset_value) Status B Register */

#define AC_STATUSB_READY0_Pos      0             /**< \brief (AC_STATUSB) Comparator 0 Ready */
#define AC_STATUSB_READY0          ( 0x1u << AC_STATUSB_READY0_Pos )
#define AC_STATUSB_READY1_Pos      1             /**< \brief (AC_STATUSB) Comparator 1 Ready */
#define AC_STATUSB_READY1          ( 0x1u << AC_STATUSB_READY1_Pos )
#define AC_STATUSB_READY2_Pos      2             /**< \brief (AC_STATUSB) Comparator 2 Ready */
#define AC_STATUSB_READY2          ( 0x1u << AC_STATUSB_READY2_Pos )
#define AC_STATUSB_READY3_Pos      3             /**< \brief (AC_STATUSB) Comparator 3 Ready */
#define AC_STATUSB_READY3          ( 0x1u << AC_STATUSB_READY3_Pos )
#define AC_STATUSB_SYNCBUSY_Pos    7             /**< \brief (AC_STATUSB) Synchronization Busy */
#define AC_STATUSB_SYNCBUSY        ( 0x1u << AC_STATUSB_SYNCBUSY_Pos )
#define AC_STATUSB_MASK            0x8Fu         /**< \brief (AC_STATUSB) MASK Register */

/* -------- AC_STATUSC : (AC Offset: 0x0A) (R/   8) Status C Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t STATE0 : 1;  /*!< bit:      0  Comparator 0 Current State         */
            uint8_t STATE1 : 1;  /*!< bit:      1  Comparator 1 Current State         */
            uint8_t STATE2 : 1;  /*!< bit:      2  Comparator 2 Current State         */
            uint8_t STATE3 : 1;  /*!< bit:      3  Comparator 3 Current State         */
            uint8_t WSTATE0 : 2; /*!< bit:  4.. 5  Window 0 Current State             */
            uint8_t WSTATE1 : 2; /*!< bit:  6.. 7  Window 1 Current State             */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } AC_STATUSC_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AC_STATUSC_OFFSET              0x0A      /**< \brief (AC_STATUSC offset) Status C Register */
#define AC_STATUSC_RESETVALUE          0x00      /**< \brief (AC_STATUSC reset_value) Status C Register */

#define AC_STATUSC_STATE0_Pos          0         /**< \brief (AC_STATUSC) Comparator 0 Current State */
#define AC_STATUSC_STATE0              ( 0x1u << AC_STATUSC_STATE0_Pos )
#define AC_STATUSC_STATE1_Pos          1         /**< \brief (AC_STATUSC) Comparator 1 Current State */
#define AC_STATUSC_STATE1              ( 0x1u << AC_STATUSC_STATE1_Pos )
#define AC_STATUSC_STATE2_Pos          2         /**< \brief (AC_STATUSC) Comparator 2 Current State */
#define AC_STATUSC_STATE2              ( 0x1u << AC_STATUSC_STATE2_Pos )
#define AC_STATUSC_STATE3_Pos          3         /**< \brief (AC_STATUSC) Comparator 3 Current State */
#define AC_STATUSC_STATE3              ( 0x1u << AC_STATUSC_STATE3_Pos )
#define AC_STATUSC_WSTATE0_Pos         4         /**< \brief (AC_STATUSC) Window 0 Current State */
#define AC_STATUSC_WSTATE0_Msk         ( 0x3u << AC_STATUSC_WSTATE0_Pos )
#define AC_STATUSC_WSTATE0( value )    ( ( AC_STATUSC_WSTATE0_Msk & ( ( value ) << AC_STATUSC_WSTATE0_Pos ) ) )
#define   AC_STATUSC_WSTATE0_ABOVE     ( 0x0u << 4 ) /**< \brief (AC_STATUSC)  */
#define   AC_STATUSC_WSTATE0_INSIDE    ( 0x1u << 4 ) /**< \brief (AC_STATUSC)  */
#define   AC_STATUSC_WSTATE0_BELOW     ( 0x2u << 4 ) /**< \brief (AC_STATUSC)  */
#define AC_STATUSC_WSTATE1_Pos         6             /**< \brief (AC_STATUSC) Window 1 Current State */
#define AC_STATUSC_WSTATE1_Msk         ( 0x3u << AC_STATUSC_WSTATE1_Pos )
#define AC_STATUSC_WSTATE1( value )    ( ( AC_STATUSC_WSTATE1_Msk & ( ( value ) << AC_STATUSC_WSTATE1_Pos ) ) )
#define   AC_STATUSC_WSTATE1_ABOVE     ( 0x0u << 6 ) /**< \brief (AC_STATUSC)  */
#define   AC_STATUSC_WSTATE1_INSIDE    ( 0x1u << 6 ) /**< \brief (AC_STATUSC)  */
#define   AC_STATUSC_WSTATE1_BELOW     ( 0x2u << 6 ) /**< \brief (AC_STATUSC)  */
#define AC_STATUSC_MASK                0xFFu         /**< \brief (AC_STATUSC) MASK Register */

/* -------- AC_WINCTRL : (AC Offset: 0x0C) (R/W  8) Window Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t WEN0 : 1;     /*!< bit:      0  Window 0 Mode Enable               */
            uint8_t WINTSEL0 : 2; /*!< bit:  1.. 2  Window 0 Interrupt Selection       */
            uint8_t  : 1;         /*!< bit:      3  Reserved                           */
            uint8_t WEN1 : 1;     /*!< bit:      4  Window 1 Mode Enable               */
            uint8_t WINTSEL1 : 2; /*!< bit:  5.. 6  Window 1 Interrupt Selection       */
            uint8_t  : 1;         /*!< bit:      7  Reserved                           */
        } bit;                    /*!< Structure used for bit  access                  */
        uint8_t reg;              /*!< Type      used for register access              */
    } AC_WINCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AC_WINCTRL_OFFSET                0x0C    /**< \brief (AC_WINCTRL offset) Window Control Register */
#define AC_WINCTRL_RESETVALUE            0x00    /**< \brief (AC_WINCTRL reset_value) Window Control Register */

