FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_ac.h
#define AC_WINCTRL_WEN0_Pos              0       /**< \brief (AC_WINCTRL) Window 0 Mode Enable */
#define AC_WINCTRL_WEN0                  ( 0x1u << AC_WINCTRL_WEN0_Pos )
#define AC_WINCTRL_WINTSEL0_Pos          1       /**< \brief (AC_WINCTRL) Window 0 Interrupt Selection */
#define AC_WINCTRL_WINTSEL0_Msk          ( 0x3u << AC_WINCTRL_WINTSEL0_Pos )
#define AC_WINCTRL_WINTSEL0( value )    ( ( AC_WINCTRL_WINTSEL0_Msk & ( ( value ) << AC_WINCTRL_WINTSEL0_Pos ) ) )
#define   AC_WINCTRL_WINTSEL0_ABOVE      ( 0x0u << 1 ) /**< \brief (AC_WINCTRL)  */
#define   AC_WINCTRL_WINTSEL0_INSIDE     ( 0x1u << 1 ) /**< \brief (AC_WINCTRL)  */
#define   AC_WINCTRL_WINTSEL0_BELOW      ( 0x2u << 1 ) /**< \brief (AC_WINCTRL)  */
#define   AC_WINCTRL_WINTSEL0_OUTSIDE    ( 0x3u << 1 ) /**< \brief (AC_WINCTRL)  */
#define AC_WINCTRL_WEN1_Pos              4             /**< \brief (AC_WINCTRL) Window 1 Mode Enable */
#define AC_WINCTRL_WEN1                  ( 0x1u << AC_WINCTRL_WEN1_Pos )
#define AC_WINCTRL_WINTSEL1_Pos          5             /**< \brief (AC_WINCTRL) Window 1 Interrupt Selection */
#define AC_WINCTRL_WINTSEL1_Msk          ( 0x3u << AC_WINCTRL_WINTSEL1_Pos )
#define AC_WINCTRL_WINTSEL1( value )    ( ( AC_WINCTRL_WINTSEL1_Msk & ( ( value ) << AC_WINCTRL_WINTSEL1_Pos ) ) )
#define   AC_WINCTRL_WINTSEL1_ABOVE      ( 0x0u << 5 ) /**< \brief (AC_WINCTRL)  */
#define   AC_WINCTRL_WINTSEL1_INSIDE     ( 0x1u << 5 ) /**< \brief (AC_WINCTRL)  */
#define   AC_WINCTRL_WINTSEL1_BELOW      ( 0x2u << 5 ) /**< \brief (AC_WINCTRL)  */
#define   AC_WINCTRL_WINTSEL1_OUTSIDE    ( 0x3u << 5 ) /**< \brief (AC_WINCTRL)  */
#define AC_WINCTRL_MASK                  0x77u         /**< \brief (AC_WINCTRL) MASK Register */

/* -------- AC_COMPCTRL : (AC Offset: 0x10) (R/W 32) Comparator Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t ENABLE : 1; /*!< bit:      0  Enable                             */
            uint32_t SINGLE : 1; /*!< bit:      1  Single-Shot Mode                   */
            uint32_t SPEED : 2;  /*!< bit:  2.. 3  Speed Selection                    */
            uint32_t : 1;        /*!< bit:      4  Reserved                           */
            uint32_t INTSEL : 2; /*!< bit:  5.. 6  Interrupt Selection                */
            uint32_t : 1;        /*!< bit:      7  Reserved                           */
            uint32_t MUXNEG : 3; /*!< bit:  8..10  Negative Input Mux Selection       */
            uint32_t : 1;        /*!< bit:     11  Reserved                           */
            uint32_t MUXPOS : 2; /*!< bit: 12..13  Positive Input Mux Selection       */
            uint32_t : 1;        /*!< bit:     14  Reserved                           */
            uint32_t SWAP : 1;   /*!< bit:     15  Swap Inputs and Invert             */
            uint32_t OUT : 2;    /*!< bit: 16..17  Output Mode                        */
            uint32_t : 1;        /*!< bit:     18  Reserved                           */
            uint32_t HYST : 1;   /*!< bit:     19  Hysteresis Enable                  */
            uint32_t : 4;        /*!< bit: 20..23  Reserved                           */
            uint32_t FLEN : 3;   /*!< bit: 24..26  Filter Length                      */
            uint32_t : 5;        /*!< bit: 27..31  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint32_t reg;            /*!< Type      used for register access              */
    } AC_COMPCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AC_COMPCTRL_OFFSET              0x10       /**< \brief (AC_COMPCTRL offset) Comparator Control Register */
#define AC_COMPCTRL_RESETVALUE          0x00000000 /**< \brief (AC_COMPCTRL reset_value) Comparator Control Register */

#define AC_COMPCTRL_ENABLE_Pos          0          /**< \brief (AC_COMPCTRL) Enable */
#define AC_COMPCTRL_ENABLE              ( 0x1u << AC_COMPCTRL_ENABLE_Pos )
#define AC_COMPCTRL_SINGLE_Pos          1          /**< \brief (AC_COMPCTRL) Single-Shot Mode */
#define AC_COMPCTRL_SINGLE              ( 0x1u << AC_COMPCTRL_SINGLE_Pos )
#define AC_COMPCTRL_SPEED_Pos           2          /**< \brief (AC_COMPCTRL) Speed Selection */
#define AC_COMPCTRL_SPEED_Msk           ( 0x3u << AC_COMPCTRL_SPEED_Pos )
#define AC_COMPCTRL_SPEED( value )    ( ( AC_COMPCTRL_SPEED_Msk & ( ( value ) << AC_COMPCTRL_SPEED_Pos ) ) )
#define   AC_COMPCTRL_SPEED_LOWPOWER    ( 0x0u << 2 ) /**< \brief (AC_COMPCTRL)  */
#define   AC_COMPCTRL_SPEED_FAST        ( 0x1u << 2 ) /**< \brief (AC_COMPCTRL)  */
#define AC_COMPCTRL_INTSEL_Pos          5             /**< \brief (AC_COMPCTRL) Interrupt Selection */
#define AC_COMPCTRL_INTSEL_Msk          ( 0x3u << AC_COMPCTRL_INTSEL_Pos )
#define AC_COMPCTRL_INTSEL( value )    ( ( AC_COMPCTRL_INTSEL_Msk & ( ( value ) << AC_COMPCTRL_INTSEL_Pos ) ) )
#define   AC_COMPCTRL_INTSEL_TOGGLE     ( 0x0u << 5 ) /**< \brief (AC_COMPCTRL)  */
#define   AC_COMPCTRL_INTSEL_RISING     ( 0x1u << 5 ) /**< \brief (AC_COMPCTRL)  */
#define   AC_COMPCTRL_INTSEL_FALLING    ( 0x2u << 5 ) /**< \brief (AC_COMPCTRL)  */
#define   AC_COMPCTRL_INTSEL_EOC        ( 0x3u << 5 ) /**< \brief (AC_COMPCTRL)  */
#define AC_COMPCTRL_MUXNEG_Pos          8             /**< \brief (AC_COMPCTRL) Negative Input Mux Selection */
#define AC_COMPCTRL_MUXNEG_Msk          ( 0x7u << AC_COMPCTRL_MUXNEG_Pos )
#define AC_COMPCTRL_MUXNEG( value )    ( ( AC_COMPCTRL_MUXNEG_Msk & ( ( value ) << AC_COMPCTRL_MUXNEG_Pos ) ) )
#define   AC_COMPCTRL_MUXNEG_PIN0       ( 0x0u << 8 ) /**< \brief (AC_COMPCTRL)  */
#define   AC_COMPCTRL_MUXNEG_PIN1       ( 0x1u << 8 ) /**< \brief (AC_COMPCTRL)  */
#define   AC_COMPCTRL_MUXNEG_PIN2       ( 0x2u << 8 ) /**< \brief (AC_COMPCTRL)  */
#define   AC_COMPCTRL_MUXNEG_PIN3       ( 0x3u << 8 ) /**< \brief (AC_COMPCTRL)  */
#define   AC_COMPCTRL_MUXNEG_GND        ( 0x4u << 8 ) /**< \brief (AC_COMPCTRL)  */
#define   AC_COMPCTRL_MUXNEG_VSCALE     ( 0x5u << 8 ) /**< \brief (AC_COMPCTRL)  */
#define   AC_COMPCTRL_MUXNEG_BANDGAP    ( 0x6u << 8 ) /**< \brief (AC_COMPCTRL)  */
#define   AC_COMPCTRL_MUXNEG_DAC        ( 0x7u << 8 ) /**< \brief (AC_COMPCTRL)  */
#define AC_COMPCTRL_MUXPOS_Pos          12            /**< \brief (AC_COMPCTRL) Positive Input Mux Selection */
#define AC_COMPCTRL_MUXPOS_Msk          ( 0x3u << AC_COMPCTRL_MUXPOS_Pos )
#define AC_COMPCTRL_MUXPOS( value )    ( ( AC_COMPCTRL_MUXPOS_Msk & ( ( value ) << AC_COMPCTRL_MUXPOS_Pos ) ) )
#define   AC_COMPCTRL_MUXPOS_PIN0       ( 0x0u << 12 ) /**< \brief (AC_COMPCTRL)  */
#define   AC_COMPCTRL_MUXPOS_PIN1       ( 0x1u << 12 ) /**< \brief (AC_COMPCTRL)  */
#define   AC_COMPCTRL_MUXPOS_PIN2       ( 0x2u << 12 ) /**< \brief (AC_COMPCTRL)  */
#define   AC_COMPCTRL_MUXPOS_PIN3       ( 0x3u << 12 ) /**< \brief (AC_COMPCTRL)  */
#define AC_COMPCTRL_SWAP_Pos            15             /**< \brief (AC_COMPCTRL) Swap Inputs and Invert */
#define AC_COMPCTRL_SWAP                ( 0x1u << AC_COMPCTRL_SWAP_Pos )
#define AC_COMPCTRL_OUT_Pos             16             /**< \brief (AC_COMPCTRL) Output Mode */
#define AC_COMPCTRL_OUT_Msk             ( 0x3u << AC_COMPCTRL_OUT_Pos )
#define AC_COMPCTRL_OUT( value )    ( ( AC_COMPCTRL_OUT_Msk & ( ( value ) << AC_COMPCTRL_OUT_Pos ) ) )
#define   AC_COMPCTRL_OUT_OFF           ( 0x0u << 16 ) /**< \brief (AC_COMPCTRL)  */
#define   AC_COMPCTRL_OUT_ASYNC         ( 0x1u << 16 ) /**< \brief (AC_COMPCTRL)  */
#define   AC_COMPCTRL_OUT_SYNC          ( 0x2u << 16 ) /**< \brief (AC_COMPCTRL)  */
#define AC_COMPCTRL_HYST_Pos            19             /**< \brief (AC_COMPCTRL) Hysteresis Enable */
#define AC_COMPCTRL_HYST                ( 0x1u << AC_COMPCTRL_HYST_Pos )
#define AC_COMPCTRL_FLEN_Pos            24             /**< \brief (AC_COMPCTRL) Filter Length */
#define AC_COMPCTRL_FLEN_Msk            ( 0x7u << AC_COMPCTRL_FLEN_Pos )
#define AC_COMPCTRL_FLEN( value )    ( ( AC_COMPCTRL_FLEN_Msk & ( ( value ) << AC_COMPCTRL_FLEN_Pos ) ) )
#define   AC_COMPCTRL_FLEN_OFF          ( 0x0u << 24 ) /**< \brief (AC_COMPCTRL)  */
#define   AC_COMPCTRL_FLEN_MAJ3         ( 0x1u << 24 ) /**< \brief (AC_COMPCTRL)  */
#define   AC_COMPCTRL_FLEN_MAJ5         ( 0x2u << 24 ) /**< \brief (AC_COMPCTRL)  */
#define AC_COMPCTRL_MASK                0x070BB76Fu    /**< \brief (AC_COMPCTRL) MASK Register */

/* -------- AC_SCALER : (AC Offset: 0x20) (R/W  8) Scaler Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t VALUE : 6; /*!< bit:  0.. 5  Scaler Value                       */
            uint8_t  : 2;      /*!< bit:  6.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } AC_SCALER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AC_SCALER_OFFSET        0x20             /**< \brief (AC_SCALER offset) Scaler Register */
#define AC_SCALER_RESETVALUE    0x00             /**< \brief (AC_SCALER reset_value) Scaler Register */

#define AC_SCALER_VALUE_Pos     0                /**< \brief (AC_SCALER) Scaler Value */
#define AC_SCALER_VALUE_Msk     ( 0x3Fu << AC_SCALER_VALUE_Pos )
#define AC_SCALER_VALUE( value )    ( ( AC_SCALER_VALUE_Msk & ( ( value ) << AC_SCALER_VALUE_Pos ) ) )
#define AC_SCALER_MASK          0x3Fu            /**< \brief (AC_SCALER) MASK Register */

/** \brief AC hardware registers */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef struct
    {
        __IO AC_CTRLA_Type CTRLA;             /**< \brief Offset: 0x00 (R/W  8) Control A Register */
        __O AC_CTRLB_Type CTRLB;              /**< \brief Offset: 0x01 ( /W  8) Control B Register */
        __IO AC_EVCTRL_Type EVCTRL;           /**< \brief Offset: 0x02 (R/W 16) Event Control Register */
        __IO AC_INTENCLR_Type INTENCLR;       /**< \brief Offset: 0x04 (R/W  8) Interrupt Enable Clear Register */
        __IO AC_INTENSET_Type INTENSET;       /**< \brief Offset: 0x05 (R/W  8) Interrupt Enable Set Register */
        __IO AC_INTFLAG_Type INTFLAG;         /**< \brief Offset: 0x06 (R/W  8) Interrupt Flag Status and Clear Register */
        RoReg8 Reserved1[ 0x1 ];
        __I AC_STATUSA_Type STATUSA;          /**< \brief Offset: 0x08 (R/   8) Status A Register */
        __I AC_STATUSB_Type STATUSB;          /**< \brief Offset: 0x09 (R/   8) Status B Register */
        __I AC_STATUSC_Type STATUSC;          /**< \brief Offset: 0x0A (R/   8) Status C Register */
        RoReg8 Reserved2[ 0x1 ];
        __IO AC_WINCTRL_Type WINCTRL;         /**< \brief Offset: 0x0C (R/W  8) Window Control Register */
        RoReg8 Reserved3[ 0x3 ];
        __IO AC_COMPCTRL_Type COMPCTRL[ 2 ];  /**< \brief Offset: 0x10 (R/W 32) Comparator Control Register [NUM_CMP] */
        RoReg8 Reserved4[ 0x8 ];
        __IO AC_SCALER_Type SCALER[ 2 ];      /**< \brief Offset: 0x20 (R/W  8) Scaler Register [NUM_CMP] */
    } Ac;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAMD20_AC_COMPONENT_ */
